## Pandas Using

In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
import numpy as np

### Series

In [4]:
obj = Series([4,7,5,-3])
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [5]:
obj.values

array([ 4,  7,  5, -3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,5,-3], index=['d','b','a','c'])
obj2

d    4
b    7
a    5
c   -3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['b']

7

In [10]:
obj2[['b','c','a']]

b    7
c   -3
a    5
dtype: int64

In [11]:
obj2 > 0

d     True
b     True
a     True
c    False
dtype: bool

In [12]:
obj2 * 2

d     8
b    14
a    10
c    -6
dtype: int64

In [13]:
np.exp(obj2)

d      54.598150
b    1096.633158
a     148.413159
c       0.049787
dtype: float64

In [14]:
'b' in obj2
'e' in obj2

False

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
obj4.name = 'population'
obj4.index.name = 'state'

In [24]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### DateFrame

In [25]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame1 = DataFrame(data)
frame1

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [26]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [27]:
frame2 = DataFrame(data,columns=['year','state','pop','debt'],
                  index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [28]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [29]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [30]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [31]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [32]:
frame2.debt = 15
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    15
two    2001    Ohio  1.7    15
three  2002    Ohio  3.6    15
four   2001  Nevada  2.4    15
five   2002  Nevada  2.9    15

In [33]:
frame2.debt = np.arange(5.)

In [34]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [35]:
val = Series([1,3,5],index=['one','three','five'])
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   1.0
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   5.0

In [36]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   1.0     True
two    2001    Ohio  1.7   NaN     True
three  2002    Ohio  3.6   3.0     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   5.0    False

In [37]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   1.0
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   5.0

In [38]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [39]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [40]:
DataFrame(pop, index=[2000,2001,2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [41]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [42]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [43]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [44]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [45]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [46]:
frame2.values

array([[2000, 'Ohio', 1.5, 1.0],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, 3.0],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, 5.0]], dtype=object)

### Index Object

In [47]:
obj = Series(range(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int32

In [48]:
objIndex = obj.index
objIndex

Index(['a', 'b', 'c'], dtype='object')

In [49]:
objIndex[1:]

Index(['b', 'c'], dtype='object')

In [50]:
## objIndex[1] = 'd'

In [51]:
index = pd.Index(np.arange(3))

In [52]:
index

Int64Index([0, 1, 2], dtype='int64')

In [53]:
obj2 = Series([1,2,3], index=index)
obj2

0    1
1    2
2    3
dtype: int64

In [54]:
obj2.index is index

True

In [55]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [56]:
'Ohio' in frame3.columns

True

In [57]:
2002 in frame3.index

True

## essential functionality

### reindex

In [58]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [59]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [60]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [61]:
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [62]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [63]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [64]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [65]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [66]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [67]:
states = ['Utah', 'Texas', 'California']
frame.reindex(columns=states)

   Utah  Texas  California
a   NaN      1           2
c   NaN      4           5
d   NaN      7           8

In [68]:
frame.reindex(index=['a','b','c','d'],columns=states)

   Utah  Texas  California
a   NaN    1.0         2.0
b   NaN    NaN         NaN
c   NaN    4.0         5.0
d   NaN    7.0         8.0

In [69]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Utah  Texas  California
a   NaN    1.0         2.0
b   NaN    NaN         NaN
c   NaN    4.0         5.0
d   NaN    7.0         8.0

### drop entries

In [70]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [71]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [72]:
obj.drop(['a','e'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [73]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio','Colorado','Utah',"New York"],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data.drop(['Ohio','Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [75]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [76]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### indexingselecting & filtering

In [77]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [78]:
obj['b']

1.0

In [79]:
obj[1]

1.0

In [80]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [81]:
obj[['a','d','c']]

a    0.0
d    3.0
c    2.0
dtype: float64

In [82]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [83]:
obj[obj > 2]

d    3.0
e    4.0
dtype: float64

In [84]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [85]:
obj['b':'d'] = 5

In [86]:
obj

a    0.0
b    5.0
c    5.0
d    5.0
e    4.0
dtype: float64

In [87]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio','Colorado','Utah',"New York"],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [89]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data[data < 5] = 0

In [92]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.loc['Utah',['one','two']]

one    8
two    9
Name: Utah, dtype: int32

In [94]:
data.loc['Utah',['one','two']]

one    8
two    9
Name: Utah, dtype: int32

In [95]:
data.ix[['Colorado','Utah'],[3,0,1]]

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [96]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [97]:
data.ix[:'Utah',1]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [98]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [99]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [102]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [103]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [104]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [105]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(15.).reshape((3, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [106]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0

In [107]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN

In [108]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0

In [109]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [110]:
df1.mean()

a    4.0
b    5.0
c    6.0
d    7.0
dtype: float64

In [111]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [112]:
df1.mean(axis=1)

0    1.5
1    5.5
2    9.5
dtype: float64

### Operations

In [113]:
arr = np.arange(12).reshape(3,4)
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [114]:
arr[0]

array([0, 1, 2, 3])

In [115]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [116]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.loc[frame.index[0]]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [117]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [118]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [119]:
series2 = Series(range(3), index=['b','e','f'])
series2

b    0
e    1
f    2
dtype: int32

In [120]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [121]:
series3 = frame.d
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [122]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### ufuns & mapping

In [123]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.710225 -0.129269  1.553738
Ohio   -1.027314 -2.081683 -2.199131
Texas   0.690006 -0.669977 -0.268114
Oregon  0.553755 -0.021253 -0.006981

In [124]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.717321
d    2.060430
e    3.752869
dtype: float64

In [125]:
frame.apply(f, axis=1)

Utah      2.263963
Ohio      1.171817
Texas     1.359983
Oregon    0.575007
dtype: float64

In [126]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])
frame.apply(f)

            b         d         e
min -1.027314 -2.081683 -2.199131
max  0.690006 -0.021253  1.553738

In [127]:
frame.apply(f,axis=1)

             min       max
Utah   -0.710225  1.553738
Ohio   -2.199131 -1.027314
Texas  -0.669977  0.690006
Oregon -0.021253  0.553755

In [128]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.71  -0.13   1.55
Ohio    -1.03  -2.08  -2.20
Texas    0.69  -0.67  -0.27
Oregon   0.55  -0.02  -0.01

In [129]:
frame.e.map(format) # Series

Utah       1.55
Ohio      -2.20
Texas     -0.27
Oregon    -0.01
Name: e, dtype: object

### Sort & rank

In [130]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [131]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [132]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [133]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [134]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [135]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [136]:
obj = Series([4,7,-2,3])

In [137]:
obj

0    4
1    7
2   -2
3    3
dtype: int64

In [138]:
obj.sort_values()

2   -2
3    3
0    4
1    7
dtype: int64

In [139]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [140]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [141]:
frame.sort_index(by='c')

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a    b    c
3  1  2.0 -2.5
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0

In [142]:
frame.sort_index(by=['a','b'])

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a    b    c
2  0 -3.0  8.0
0  0  4.3 -2.0
3  1  2.0 -2.5
1  1  7.0  5.0

In [143]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [144]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [145]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [146]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [147]:
frame.rank(axis=1,method='first')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [148]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [149]:
obj.index.is_unique

False

In [150]:
obj.a

a    0
a    1
dtype: int32

In [151]:
obj.c

4

In [152]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.973494 -0.149582  0.730020
a -1.876410 -1.270886 -1.084988
b  0.024360  0.429664  1.057894
b  0.711491  1.056352 -1.045120

In [153]:
df.loc['a']

          0         1         2
a -1.973494 -0.149582  0.730020
a -1.876410 -1.270886 -1.084988

### statistics

In [154]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [155]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [156]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [157]:
df.sum(axis=1,skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [158]:
df.idxmax()

one    b
two    d
dtype: object

In [159]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [160]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [161]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [162]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [163]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [164]:
df.var()

one    12.205833
two     5.120000
dtype: float64

### Correlation and covariance

In [165]:
#import pandas.io.data as web
import pandas_datareader.data as web
import datetime

all_data = {}
for ticker in ['AAPL', 'GOOG']:
    all_data[ticker] = web.DataReader(ticker,'yahoo', '1/1/2001', '1/1/2010')

In [166]:
all_data

{'AAPL':                  Open       High        Low      Close  Adj Close     Volume
 Date
 2001-01-02   1.062500   1.089286   1.040179   1.062500   0.952460  113078000
 2001-01-03   1.035714   1.191964   1.031250   1.169643   1.048507  204268400
 2001-01-04   1.295757   1.321429   1.200893   1.218750   1.092528  184849000
 2001-01-05   1.209821   1.241071   1.147321   1.169643   1.048507  103089000
 2001-01-08   1.209821   1.213164   1.138393   1.183036   1.060513   93424800
 2001-01-09   1.200893   1.260043   1.183036   1.227679   1.100532  147232400
 2001-01-10   1.191964   1.214286   1.147321   1.183036   1.060513  145195400
 2001-01-11   1.160714   1.321429   1.160714   1.285714   1.152557  200933600
 2001-01-12   1.276786   1.285714   1.218750   1.227679   1.100532  105844200
 2001-01-16   1.245536   1.303571   1.214286   1.223214   1.096530   76529600
 2001-01-17   1.254464   1.254464   1.178571   1.200893   1.076520  210218400
 2001-01-18   1.272321   1.339286   1.258929   1.334821   1.196579  306752600
 2001-01-19   1.388393   1.397321   1.334821   1.392857   1.248604  194166000
 2001-01-22   1.361607   1.401786   1.316964   1.375000   1.232596  129831800
 2001-01-23   1.379464   1.495536   1.361607   1.464286   1.312635  219882600
 2001-01-24   1.473214   1.477679   1.397321   1.464286   1.312635  179272800
 2001-01-25   1.468750   1.468750   1.410714   1.424107   1.276617  122427200
 2001-01-26   1.392857   1.415179   1.361607   1.397321   1.252606  120705200
 2001-01-29   1.397321   1.553571   1.397321   1.549107   1.388672  213882200
 2001-01-30   1.540179   1.571429   1.491071   1.553571   1.392674  173105800
 2001-01-31   1.535714   1.607143   1.531250   1.544643   1.384670  182676200
 2001-02-01   1.477679   1.535714   1.464286   1.508929   1.352654   92423800
 2001-02-02   1.508929   1.566964   1.464286   1.473214   1.320639  106835400
 2001-02-05   1.464286   1.468750   1.410714   1.441964   1.292625   71528800
 2001-02-06   1.439729   1.527900   1.428571   1.508929   1.352654  115677800
 2001-02-07   1.475443   1.491071   1.415179   1.482143   1.328642   98471800
 2001-02-08   1.468750   1.504464   1.441964   1.482143   1.328642  151032000
 2001-02-09   1.464286   1.486607   1.334821   1.366071   1.224592  147520800
 2001-02-12   1.361607   1.428571   1.343750   1.406250   1.260610   68530000
 2001-02-13   1.424107   1.459821   1.357143   1.366071   1.224592   59267600
 ...               ...        ...        ...        ...        ...        ...
 2009-11-18  29.505714  29.571428  29.142857  29.422857  26.375631   93580200
 2009-11-19  29.230000  29.230000  28.542856  28.644285  25.677694  135581600
 2009-11-20  28.450001  28.627142  28.251429  28.559999  25.602137  101666600
 2009-11-23  29.000000  29.428572  28.992857  29.411428  26.365387  118724200
 2009-11-24  29.332857  29.411428  28.985714  29.205715  26.180979   79609600
 2009-11-25  29.342857  29.378571  29.108572  29.170000  26.148968   71613500
 2009-11-27  28.459999  28.994286  28.338572  28.655714  25.687944   73814300
 2009-11-30  28.730000  28.811428  28.395714  28.558571  25.600855  106214500
 2009-12-01  28.891428  28.967142  28.118572  28.138571  25.224354  116440800
 2009-12-02  28.422857  28.774286  27.964285  28.032858  25.129593  178815000
 2009-12-03  28.202858  28.425714  28.038572  28.068571  25.161610  112179900
 2009-12-04  28.528572  28.554285  27.182858  27.617144  24.756933  206721200
 2009-12-07  27.617144  27.681429  26.954287  26.992857  24.197300  178689700
 2009-12-08  27.051428  27.478571  26.957144  27.124287  24.315115  172599700
 2009-12-09  27.325714  28.308571  27.187143  28.257143  25.330648  171195500
 2009-12-10  28.500000  28.528572  28.017143  28.061428  25.155205  122417400
 2009-12-11  28.254286  28.285715  27.632856  27.809999  24.929808  107443700
 2009-12-14  27.910000  28.204287  27.508572  28.139999  25.225637  123947600
 2009-12-15  27.975714  28.215714  27.610001  27.738571  24.865784  104864900
 2009-12-16  27.871429  28.071428  27.792856  27.861429  24.975916   88246200
 2009-12-17  27.751429  27.857143  27.285715  27.408571  24.569962   97209700
 2009-12-18  27.595715  27.928572  27.514286  27.918571  25.027142  152192600
 2009-12-21  28.007143  28.535715  27.952858  28.318571  25.385717  152976600
 2009-12-22  28.491428  28.692858  28.379999  28.622858  25.658489   87378900
 2009-12-23  28.742857  28.911428  28.687143  28.871429  25.881313   86381400
 2009-12-24  29.078571  29.907143  29.049999  29.862858  26.770067  125222300
 2009-12-28  30.245714  30.564285  29.944286  30.230000  27.099184  161141400
 2009-12-29  30.375713  30.388571  29.818571  29.871429  26.777750  111301400
 2009-12-30  29.832857  30.285715  29.758572  30.234285  27.103024  103021100
 2009-12-31  30.447144  30.478571  30.080000  30.104286  26.986492   88102700

 [2263 rows x 6 columns],
 'GOOG':                   Open        High         Low       Close   Adj Close  \
 Date
 2004-08-19   49.676899   51.693783   47.669952   49.845802   49.845802
 2004-08-20   50.178635   54.187561   49.925285   53.805050   53.805050
 2004-08-23   55.017166   56.373344   54.172661   54.346527   54.346527
 2004-08-24   55.260582   55.439419   51.450363   52.096165   52.096165
 2004-08-25   52.140873   53.651051   51.604362   52.657513   52.657513
 2004-08-26   52.135906   53.626213   51.991844   53.606342   53.606342
 2004-08-27   53.700729   53.959049   52.503513   52.732029   52.732029
 2004-08-30   52.299839   52.404160   50.675404   50.675404   50.675404
 2004-08-31   50.819469   51.519913   50.749920   50.854240   50.854240
 2004-09-01   51.018177   51.152302   49.512966   49.801090   49.801090
 2004-09-02   49.274517   50.854240   49.150326   50.427021   50.427021
 2004-09-03   50.148830   50.541279   49.339096   49.681866   49.681866
 2004-09-07   50.178635   50.670437   49.483158   50.461796   50.461796
 2004-09-08   50.044510   51.182110   49.925285   50.819469   50.819469
 2004-09-09   50.933723   51.023144   50.173668   50.824436   50.824436
 2004-09-10   50.471729   52.935703   50.322701   52.324677   52.324677
 2004-09-13   52.970478   53.854729   52.886028   53.402668   53.402668
 2004-09-14   53.377831   55.638126   53.049961   55.384777   55.384777
 2004-09-15   54.922779   56.745922   54.743942   55.638126   55.638126
 2004-09-16   55.807030   57.525848   55.464260   56.616764   56.616764
 2004-09-17   56.840309   58.365391   56.408119   58.365391   58.365391
 2004-09-20   58.097134   60.407108   58.007717   59.294346   59.294346
 2004-09-21   59.517895   59.820923   58.375324   58.539257   58.539257
 2004-09-22   58.320679   59.448345   58.027588   58.807514   58.807514
 2004-09-23   59.036026   60.918781   58.131908   60.019630   60.019630
 2004-09-24   60.079243   61.649033   59.493053   59.527828   59.527828
 2004-09-27   59.393700   60.049435   58.519386   58.747902   58.747902
 2004-09-28   60.258080   63.288372   59.716602   63.020115   63.020115
 2004-09-29   62.940632   67.073753   62.707150   65.116478   65.116478
 2004-09-30   64.530296   65.722542   64.083199   64.381264   64.381264
 ...                ...         ...         ...         ...         ...
 2009-11-18  286.461853  287.519958  284.186646  286.461853  286.461853
 2009-11-19  285.031158  285.145416  283.158325  284.643677  284.643677
 2009-11-20  282.909943  283.953156  282.860260  283.138458  283.138458
 2009-11-23  286.382355  291.404694  286.069397  289.293427  289.293427
 2009-11-24  289.377869  290.257172  286.407196  289.661041  289.661041
 2009-11-25  291.310303  291.633209  289.462341  290.977478  290.977478
 2009-11-27  284.151855  289.348083  283.640198  288.006805  288.006805
 2009-11-30  288.438995  289.949158  286.690369  289.616333  289.616333
 2009-12-01  292.164764  293.699768  289.616333  293.029114  293.029114
 2009-12-02  293.590485  294.588989  291.215912  291.856750  291.856750
 2009-12-03  292.616821  293.814026  290.609863  290.977478  290.977478
 2009-12-04  294.593964  295.493103  287.718658  290.614838  290.614838
 2009-12-07  290.217407  292.442932  288.622772  291.230835  291.230835
 2009-12-08  289.864716  293.421570  289.119568  291.628235  291.628235
 2009-12-09  291.851776  292.760864  289.904449  292.606873  292.606873
 2009-12-10  293.312286  295.433502  293.297394  293.838867  293.838867
 2009-12-11  295.418579  295.453369  291.966034  293.347046  293.347046
 2009-12-14  295.751434  296.725098  294.390289  295.940186  295.940186
 2009-12-15  294.733032  296.263092  293.585510  294.653564  294.653564
 2009-12-16  297.365936  298.245209  296.392242  296.948639  296.948639
 2009-12-17  296.292908  296.889038  294.961548  295.050964  295.050964
 2009-12-18  296.089233  297.529846  295.577545  296.282959  296.282959
 2009-12-21  296.874115  297.981903  295.910400  297.405670  297.405670
 2009-12-22  298.727081  298.806549  297.490112  298.617767  298.617767
 2009-12-23  299.800079  304.454803  299.477203  303.863647  303.863647
 2009-12-24  304.484619  307.758331  304.156738  307.241699  307.241699
 2009-12-28  308.821411  310.972412  307.241699  309.422516  309.422516
 2009-12-29  310.351471  310.401154  307.147308  307.698730  307.698730
 2009-12-30  307.251617  309.352966  307.008209  309.352966  309.352966
 2009-12-31  310.356445  310.679321  307.986847  307.986847  307.986847

               Volume
 Date
 2004-08-19  44994500
 2004-08-20  23005800
 2004-08-23  18393200
 2004-08-24  15361800
 2004-08-25   9257400
 2004-08-26   7148200
 2004-08-27   6258300
 2004-08-30   5235700
 2004-08-31   4954800
 2004-09-01   9206800
 2004-09-02  15232100
 2004-09-03   5191000
 2004-09-07   5891300
 2004-09-08   5023000
 2004-09-09   4092100
 2004-09-10   8764200
 2004-09-13   7902900
 2004-09-14  10910200
 2004-09-15  10793500
 2004-09-16   9335800
 2004-09-17   9543500
 2004-09-20  10708500
 2004-09-21   7282900
 2004-09-22   7638000
 2004-09-23   8599600
 2004-09-24   9191900
 2004-09-27   7119100
 2004-09-28  17056100
 2004-09-29  30745600
 2004-09-30  13861300
 ...              ...
 2009-11-18   3119200
 2009-11-19   4364100
 2009-11-20   4038500
 2009-11-23   5128000
 2009-11-24   3231200
 2009-11-25   2941400
 2009-11-27   2787100
 2009-11-30   3472500
 2009-12-01   4670700
 2009-12-02   3348000
 2009-12-03   2875900
 2009-12-04   5059900
 2009-12-07   3293500
 2009-12-08   3067700
 2009-12-09   3585000
 2009-12-10   3358200
 2009-12-11   3462300
 2009-12-14   3851600
 2009-12-15   4590400
 2009-12-16   5655300
 2009-12-17   5311800
 2009-12-18   7108900
 2009-12-21   5175800
 2009-12-22   3786000
 2009-12-23   4172200
 2009-12-24   1728500
 2009-12-28   3417800
 2009-12-29   2868100
 2009-12-30   2950200
 2009-12-31   2455400

 [1353 rows x 6 columns]}

In [167]:
price = DataFrame({tic:data['Adj Close'] for tic,data in all_data.items()})
price

                 AAPL        GOOG
Date
2001-01-02   0.952460         NaN
2001-01-03   1.048507         NaN
2001-01-04   1.092528         NaN
2001-01-05   1.048507         NaN
2001-01-08   1.060513         NaN
2001-01-09   1.100532         NaN
2001-01-10   1.060513         NaN
2001-01-11   1.152557         NaN
2001-01-12   1.100532         NaN
2001-01-16   1.096530         NaN
2001-01-17   1.076520         NaN
2001-01-18   1.196579         NaN
2001-01-19   1.248604         NaN
2001-01-22   1.232596         NaN
2001-01-23   1.312635         NaN
2001-01-24   1.312635         NaN
2001-01-25   1.276617         NaN
2001-01-26   1.252606         NaN
2001-01-29   1.388672         NaN
2001-01-30   1.392674         NaN
2001-01-31   1.384670         NaN
2001-02-01   1.352654         NaN
2001-02-02   1.320639         NaN
2001-02-05   1.292625         NaN
2001-02-06   1.352654         NaN
2001-02-07   1.328642         NaN
2001-02-08   1.328642         NaN
2001-02-09   1.224592         NaN
2001-02-12   1.260610         NaN
2001-02-13   1.224592         NaN
...               ...         ...
2009-11-18  26.375631  286.461853
2009-11-19  25.677694  284.643677
2009-11-20  25.602137  283.138458
2009-11-23  26.365387  289.293427
2009-11-24  26.180979  289.661041
2009-11-25  26.148968  290.977478
2009-11-27  25.687944  288.006805
2009-11-30  25.600855  289.616333
2009-12-01  25.224354  293.029114
2009-12-02  25.129593  291.856750
2009-12-03  25.161610  290.977478
2009-12-04  24.756933  290.614838
2009-12-07  24.197300  291.230835
2009-12-08  24.315115  291.628235
2009-12-09  25.330648  292.606873
2009-12-10  25.155205  293.838867
2009-12-11  24.929808  293.347046
2009-12-14  25.225637  295.940186
2009-12-15  24.865784  294.653564
2009-12-16  24.975916  296.948639
2009-12-17  24.569962  295.050964
2009-12-18  25.027142  296.282959
2009-12-21  25.385717  297.405670
2009-12-22  25.658489  298.617767
2009-12-23  25.881313  303.863647
2009-12-24  26.770067  307.241699
2009-12-28  27.099184  309.422516
2009-12-29  26.777750  307.698730
2009-12-30  27.103024  309.352966
2009-12-31  26.986492  307.986847

[2263 rows x 2 columns]

In [168]:
volume = DataFrame({tic:data['Volume'] for tic,data in all_data.items()})
volume

                 AAPL       GOOG
Date
2001-01-02  113078000        NaN
2001-01-03  204268400        NaN
2001-01-04  184849000        NaN
2001-01-05  103089000        NaN
2001-01-08   93424800        NaN
2001-01-09  147232400        NaN
2001-01-10  145195400        NaN
2001-01-11  200933600        NaN
2001-01-12  105844200        NaN
2001-01-16   76529600        NaN
2001-01-17  210218400        NaN
2001-01-18  306752600        NaN
2001-01-19  194166000        NaN
2001-01-22  129831800        NaN
2001-01-23  219882600        NaN
2001-01-24  179272800        NaN
2001-01-25  122427200        NaN
2001-01-26  120705200        NaN
2001-01-29  213882200        NaN
2001-01-30  173105800        NaN
2001-01-31  182676200        NaN
2001-02-01   92423800        NaN
2001-02-02  106835400        NaN
2001-02-05   71528800        NaN
2001-02-06  115677800        NaN
2001-02-07   98471800        NaN
2001-02-08  151032000        NaN
2001-02-09  147520800        NaN
2001-02-12   68530000        NaN
2001-02-13   59267600        NaN
...               ...        ...
2009-11-18   93580200  3119200.0
2009-11-19  135581600  4364100.0
2009-11-20  101666600  4038500.0
2009-11-23  118724200  5128000.0
2009-11-24   79609600  3231200.0
2009-11-25   71613500  2941400.0
2009-11-27   73814300  2787100.0
2009-11-30  106214500  3472500.0
2009-12-01  116440800  4670700.0
2009-12-02  178815000  3348000.0
2009-12-03  112179900  2875900.0
2009-12-04  206721200  5059900.0
2009-12-07  178689700  3293500.0
2009-12-08  172599700  3067700.0
2009-12-09  171195500  3585000.0
2009-12-10  122417400  3358200.0
2009-12-11  107443700  3462300.0
2009-12-14  123947600  3851600.0
2009-12-15  104864900  4590400.0
2009-12-16   88246200  5655300.0
2009-12-17   97209700  5311800.0
2009-12-18  152192600  7108900.0
2009-12-21  152976600  5175800.0
2009-12-22   87378900  3786000.0
2009-12-23   86381400  4172200.0
2009-12-24  125222300  1728500.0
2009-12-28  161141400  3417800.0
2009-12-29  111301400  2868100.0
2009-12-30  103021100  2950200.0
2009-12-31   88102700  2455400.0

[2263 rows x 2 columns]

In [169]:
returns = price.pct_change()
returns

                AAPL      GOOG
Date
2001-01-02       NaN       NaN
2001-01-03  0.100841       NaN
2001-01-04  0.041984       NaN
2001-01-05 -0.040293       NaN
2001-01-08  0.011451       NaN
2001-01-09  0.037736       NaN
2001-01-10 -0.036363       NaN
2001-01-11  0.086792       NaN
2001-01-12 -0.045139       NaN
2001-01-16 -0.003636       NaN
2001-01-17 -0.018248       NaN
2001-01-18  0.111525       NaN
2001-01-19  0.043478       NaN
2001-01-22 -0.012821       NaN
2001-01-23  0.064935       NaN
2001-01-24  0.000000       NaN
2001-01-25 -0.027439       NaN
2001-01-26 -0.018808       NaN
2001-01-29  0.108626       NaN
2001-01-30  0.002882       NaN
2001-01-31 -0.005747       NaN
2001-02-01 -0.023122       NaN
2001-02-02 -0.023668       NaN
2001-02-05 -0.021212       NaN
2001-02-06  0.046440       NaN
2001-02-07 -0.017752       NaN
2001-02-08  0.000000       NaN
2001-02-09 -0.078313       NaN
2001-02-12  0.029412       NaN
2001-02-13 -0.028572       NaN
...              ...       ...
2009-11-18 -0.005024 -0.001455
2009-11-19 -0.026461 -0.006347
2009-11-20 -0.002943 -0.005288
2009-11-23  0.029812  0.021738
2009-11-24 -0.006994  0.001271
2009-11-25 -0.001223  0.004545
2009-11-27 -0.017631 -0.010209
2009-11-30 -0.003390  0.005589
2009-12-01 -0.014707  0.011784
2009-12-02 -0.003757 -0.004001
2009-12-03  0.001274 -0.003013
2009-12-04 -0.016083 -0.001246
2009-12-07 -0.022605  0.002120
2009-12-08  0.004869  0.001365
2009-12-09  0.041766  0.003356
2009-12-10 -0.006926  0.004210
2009-12-11 -0.008960 -0.001674
2009-12-14  0.011866  0.008840
2009-12-15 -0.014265 -0.004348
2009-12-16  0.004429  0.007789
2009-12-17 -0.016254 -0.006391
2009-12-18  0.018607  0.004176
2009-12-21  0.014327  0.003789
2009-12-22  0.010745  0.004076
2009-12-23  0.008684  0.017567
2009-12-24  0.034340  0.011117
2009-12-28  0.012294  0.007098
2009-12-29 -0.011861 -0.005571
2009-12-30  0.012147  0.005376
2009-12-31 -0.004300 -0.004416

[2263 rows x 2 columns]

In [170]:
returns.corr()

          AAPL      GOOG
AAPL  1.000000  0.470676
GOOG  0.470676  1.000000

In [171]:
df = DataFrame(np.random.randn(6,4), index=list('abcdef'),
              columns=['HZ','SZ','BJ','SZ'])
df

         HZ        SZ        BJ        SZ
a -0.495461  0.925780  0.336153  0.320924
b -0.523333  0.063323  0.215398  1.835224
c -0.709999 -0.654178  0.746107 -1.269010
d -0.303565  2.528109 -0.395320 -0.900958
e -0.348805  0.301223  0.073235 -1.720292
f -2.042628  1.228370  2.273527 -0.056963

In [172]:
returns = df.pct_change()
returns

         HZ         SZ         BJ        SZ
a       NaN        NaN        NaN       NaN
b  0.056256  -0.931600  -0.359225  4.718562
c  0.356687 -11.330743   2.463848 -1.691474
d -0.572443  -4.864555  -1.529844 -0.290031
e  0.149030  -0.880850  -1.185254  0.909403
f  4.856070   3.077940  30.044462 -0.966888

In [173]:
returns.tail()

         HZ         SZ         BJ        SZ
b  0.056256  -0.931600  -0.359225  4.718562
c  0.356687 -11.330743   2.463848 -1.691474
d -0.572443  -4.864555  -1.529844 -0.290031
e  0.149030  -0.880850  -1.185254  0.909403
f  4.856070   3.077940  30.044462 -0.966888

In [174]:
returns.HZ.corr(returns.BJ)

0.99392576618524153

In [175]:
returns.corr()

          HZ        SZ        BJ        SZ
HZ  1.000000  0.583758  0.993926 -0.329548
SZ  0.583758  1.000000  0.544633  0.370797
BJ  0.993926  0.544633  1.000000 -0.373501
SZ -0.329548  0.370797 -0.373501  1.000000

In [176]:
returns.corrwith(returns.BJ)

HZ    0.993926
SZ    0.544633
BJ    1.000000
SZ   -0.373501
dtype: float64

### Unique values, value counts, and membership

In [177]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [178]:
uniques = obj.unique()

In [179]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [180]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [181]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [182]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [183]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [184]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling Missing Data

In [185]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [186]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [187]:
string_data[0] = None

In [188]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [189]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [190]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [191]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [192]:
data.fillna(0)

0    1.0
1    0.0
2    3.5
3    0.0
4    7.0
dtype: float64

In [193]:
df = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [194]:
df.dropna()

     0    1    2
0  1.0  6.5  3.0

In [195]:
df.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [196]:
data[4] = NA

In [197]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    NaN
dtype: float64

In [198]:
df[4] = NA
df

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [199]:
df.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [200]:
df2 = DataFrame(np.random.randn(7,3))
df2

          0         1         2
0 -0.523981 -0.684485  0.262049
1 -0.364361  0.172153  0.020915
2  0.712026  0.754711  0.701131
3 -0.153251  1.469046 -0.692170
4  0.795681  0.331211 -0.126371
5 -0.784611  1.440935 -0.507963
6 -0.587424  1.166417  0.850996

In [201]:
df2.loc[:4, 1] = NA
df2

          0         1         2
0 -0.523981       NaN  0.262049
1 -0.364361       NaN  0.020915
2  0.712026       NaN  0.701131
3 -0.153251       NaN -0.692170
4  0.795681       NaN -0.126371
5 -0.784611  1.440935 -0.507963
6 -0.587424  1.166417  0.850996

In [202]:
df2.loc[:2, 2] =NA

In [203]:
df2

          0         1         2
0 -0.523981       NaN       NaN
1 -0.364361       NaN       NaN
2  0.712026       NaN       NaN
3 -0.153251       NaN -0.692170
4  0.795681       NaN -0.126371
5 -0.784611  1.440935 -0.507963
6 -0.587424  1.166417  0.850996

In [204]:
df2.fillna(0)

          0         1         2
0 -0.523981  0.000000  0.000000
1 -0.364361  0.000000  0.000000
2  0.712026  0.000000  0.000000
3 -0.153251  0.000000 -0.692170
4  0.795681  0.000000 -0.126371
5 -0.784611  1.440935 -0.507963
6 -0.587424  1.166417  0.850996

In [205]:
df2.fillna({1:0.5,2:-1})

          0         1         2
0 -0.523981  0.500000 -1.000000
1 -0.364361  0.500000 -1.000000
2  0.712026  0.500000 -1.000000
3 -0.153251  0.500000 -0.692170
4  0.795681  0.500000 -0.126371
5 -0.784611  1.440935 -0.507963
6 -0.587424  1.166417  0.850996

In [206]:
df3 = DataFrame(np.random.randn(7, 3))
df3.loc[:4, 1] = NA; df3.loc[:2, 2] = NA
df3

          0         1         2
0  0.425510       NaN       NaN
1  0.172833       NaN       NaN
2  0.268062       NaN       NaN
3  0.206161       NaN  0.260831
4 -0.227095       NaN -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [207]:
df3.dropna(thresh = 2)

          0         1         2
3  0.206161       NaN  0.260831
4 -0.227095       NaN -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [208]:
df3

          0         1         2
0  0.425510       NaN       NaN
1  0.172833       NaN       NaN
2  0.268062       NaN       NaN
3  0.206161       NaN  0.260831
4 -0.227095       NaN -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [209]:
df3.fillna(method='ffill')

          0         1         2
0  0.425510       NaN       NaN
1  0.172833       NaN       NaN
2  0.268062       NaN       NaN
3  0.206161       NaN  0.260831
4 -0.227095       NaN -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [210]:
df3.loc[0] = np.arange(3)

In [211]:
df3

          0         1         2
0  0.000000  1.000000  2.000000
1  0.172833       NaN       NaN
2  0.268062       NaN       NaN
3  0.206161       NaN  0.260831
4 -0.227095       NaN -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [212]:
df3.fillna(method='ffill')

          0         1         2
0  0.000000  1.000000  2.000000
1  0.172833  1.000000  2.000000
2  0.268062  1.000000  2.000000
3  0.206161  1.000000  0.260831
4 -0.227095  1.000000 -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [213]:
df3.fillna(method='ffill',limit=2)

          0         1         2
0  0.000000  1.000000  2.000000
1  0.172833  1.000000  2.000000
2  0.268062  1.000000  2.000000
3  0.206161       NaN  0.260831
4 -0.227095       NaN -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [214]:
df3.fillna(data.mean())

          0         1         2
0  0.000000  1.000000  2.000000
1  0.172833  2.250000  2.250000
2  0.268062  2.250000  2.250000
3  0.206161  2.250000  0.260831
4 -0.227095  2.250000 -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

In [215]:
df3.fillna(data.mean(),axis=1)

          0         1         2
0  0.000000  1.000000  2.000000
1  0.172833  2.250000  2.250000
2  0.268062  2.250000  2.250000
3  0.206161  2.250000  0.260831
4 -0.227095  2.250000 -0.146478
5 -1.904783  1.200536 -0.020097
6 -0.910296 -0.357329  1.091141

### Hierarchical indexing

In [216]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -1.344103
   2   -1.117613
   3   -0.346540
b  1   -1.059981
   2    1.896612
   3    0.198817
c  1   -0.404307
   2   -1.908305
d  2   -1.096652
   3    1.856850
dtype: float64

In [217]:
data['a']

1   -1.344103
2   -1.117613
3   -0.346540
dtype: float64

In [218]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [219]:
data[:,2]

a   -1.117613
b    1.896612
c   -1.908305
d   -1.096652
dtype: float64

In [220]:
data.unstack()

          1         2         3
a -1.344103 -1.117613 -0.346540
b -1.059981  1.896612  0.198817
c -0.404307 -1.908305       NaN
d       NaN -1.096652  1.856850

In [221]:
data.unstack().stack()

a  1   -1.344103
   2   -1.117613
   3   -0.346540
b  1   -1.059981
   2    1.896612
   3    0.198817
c  1   -0.404307
   2   -1.908305
d  2   -1.096652
   3    1.856850
dtype: float64

In [222]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [223]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [224]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [225]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [226]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [227]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [228]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [229]:
frame.swaplevel(0,1).sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [230]:
frame.sum(level=0)

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [231]:
frame.sum(level=1)

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [232]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [233]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [234]:
frame2 = frame.set_index(['c'])

In [235]:
frame2

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [236]:
frame3 = frame.set_index(['c','d'])

In [237]:
frame3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [238]:
frame4 = frame.set_index(['c','d'],drop=False)
frame4

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [239]:
frame2

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [240]:
frame2.reset_index()

     c  a  b  d
0  one  0  7  0
1  one  1  6  1
2  one  2  5  2
3  two  3  4  0
4  two  4  3  1
5  two  5  2  2
6  two  6  1  3